{
  "blogs": [
    {
      "title": "Fashion blog",
      "description": "Fashion is a multi-billion dollar industry that has considerable impact on the way ordinary people dress and present themselves and relies heavily on media and advertising to communicate the producer's preferences and goals and influence public perception through various types of promotion; at the same time, fashion can be influenced by social change and counter-trends outside the producer, retailer or advertiser's control. As fashion is driven by trends within and without the fashion industry, fashion blogs and other \"new media\" outside the control of traditional establishment represent a disruptive innovation to the social dynamics of mass media and fashion consumption in modern consumer society. It is likely that the blogosphere will have a considerable long-term influence on the industry, as the number of fashion based blogs continue to grow, with increasing numbers of consumers able to create and modify the media that they consume, and traditional producers and advertisers adapting their practices to avoid dilution of their own influence.Some blogs focus more on fashion advice, featuring how-to articles for the lay reader. Articles discuss clothing fit, the matching and complementing of colors, and other information on clothes wearing and care, along with prescriptive advice on adhering to basic standards and recent trends.Founder of Independent Fashion Blogger (IFB) Jennine Jacob stated how thrilled she was to get the validation from high-end fashion designers (such as Proenza Schouler) that fashion blogging has an incredible impact on the fashion world. Imran Amed stated that there will always be designers and editors that will never fully wrap their head on the huge impact fashion blogging and social media has on the industry, but on the other side of the spectrum, there are numerous designers, editors, branders and writers that do understand and are “coming on board”. He also states that this is a fairly new phenomenon that will take time for the fashion world to reap the full benefits",
      "category": "Fashion",
      "imageUrl": "https://res.cloudinary.com/amradham/image/upload/v1657458655/blog/ivaziqivneu7spcv1fia.jpg",
      "author": "Yara",
      "date": "07/10/2022",
      "id": 1
    },
    {
      "title": "Travel Blog ",
      "description": "The word travel has come to exemplify a common spelling quandary: to double or not to double the final consonant of a verb before adding the ending that forms the past tense ( –ed ) or the ending that forms the present-participle ( –ing. ) We see it done both ways—sometimes with the same word ( travel, traveled, traveling; travel, travelled, travelling ). As readers, we accept these variations without even thinking about them. But as writers, we need to know just when we should double that final consonant and when we should not. Because American practice differs slightly from British practice, there is no one answer. But there are well-established conventions.\nIn American writing, when you have a one-syllable verb that ends with a single vowel followed by a single consonant, and you want to add a regular inflectional ending that begins with a vowel, you double that final consonant before adding -ed or -ing : stop, stopped, stopping; flag, flagged, flagging. This principle also holds for verbs of more than one syllable if the final syllable is stressed: permit, permitted, permitting; refer, referred, referring. If that syllable is not stressed, there is no doubling of the final consonant: gallop, galloped, galloping; travel, traveled, traveling.",
      "category": "Travel",
      "imageUrl": "https://res.cloudinary.com/amradham/image/upload/v1657432931/blog/qswpyt4fdryvre9thgk4.jpg",
      "date": "07/06/2022",
      "id": 2,
      "author": "Amr "
    },
    {
      "title": "Tech Blog",
      "description": "The subject of technology is treated in a number of articles. For general treatment, see technology, history of; hand tool. For description of the materials that are both the object and means of manipulating the environment, see elastomers; industrial ceramics; industrial glass; metallurgy; mineral deposit; mineral processing; mining; plastic. For the generation of energy, see energy conversion; coal mining; coal utilization; petroleum production; petroleum refining. For treatment of production, see agriculture, history of; agricultural economics; beekeeping; beer; cereal farming; coffee; commercial fishing; dairy farming; distilled spirit; preservation; fruit farming; livestock farming; poultry farming; soft drink; tea; vegetable farming; wine. For the techniques of construction technology, see bridge; building construction; canals and inland waterways; dam; harbours and sea works; lighthouse; roads and highways; tunnels and underground excavations;",
      "category": "Tech",
      "imageUrl": "http://res.cloudinary.com/amradham/image/upload/v1657158837/pzkau07wbeyvwlj7zilk.jpg",
      "author": "Yara",
      "date": "07/07/2022",
      "id": 3
    },
    {
      "title": "Sport Blog",
      "description": "Cristiano Ronaldo's move to Man Utd from Juventus in the summer of 2021 was undoubtedly one of the biggest transfer stories in the world of football as the Portuguese legend returned to Old Trafford after 12 years away.Most Premier League pundits, though, predicted a successful campaign for the Portugal great.\n\nAll in all, Ronaldo enjoyed an excellent season individually but it was a disaster from a team point of view as Man Utd endured their most disappointing campaign since the Premier League was formed in 1992, finishing sixth and winning no trophies.,Ronaldo made his second debut for United against Newcastle on September 11, 2021. It was a dream day for the Portugal star as he scored twice in a 4-1 win at Old Trafford.\n\nIndeed, the veteran made an incredible start to the season with United as he scored four goals in his first week. This included his first Champions League goal in his first Champions League appearance of 2021-22 against Young Boys and a strike in a 2-1 win over West Ham.Ronaldo suffered his first Premier League defeat back at United in a 1-0 home loss to Aston Villa but continued to be a clutch player in key moments.\n\nHe scored a winner deep into injury time to clinch a 2-1 UCL victory over Villarreal on September 29 and then headed home another late clincher in the 3-2 comeback win over Atalanta. He also fired home late on to rescue a point in the 2-2 draw away at Atalanta.",
      "category": "Sports",
      "imageUrl": "https://res.cloudinary.com/amradham/image/upload/v1657460927/blog/wn2hgop2n3sg4qswrigv.jpg",
      "author": "Amr ",
      "date": "07/07/2022",
      "id": 4
    },
    {
      "title": "Fitness",
      "description": "what makes a great gym Running a gym is tough. State-of-the-art equipment and competitive pricing are important. But these are just a fraction of what makes a gym great. There are several cogs that work together to create a successful fitness business that retains members and drives value. Although the equipment you have can make or break a member’s decision to join your facility, the fitness experience will increase member retention.Ultimately, the fitness equipment you have will be determined by your niche. For traditional facilities, you will need pieces of equipment like treadmills, free weights, and rowing machines. For spinning studios, you would expect high-end indoor bikes and not a lot else. Your gym needs to meet the requirements of your members. The layout and space, people, equipment, and workout all contribute to a great gym. You need the right mixture to deliver the best experience.Joining a gym is a commitment. You have to invest your time and finances. With pay-as-you-go business models, monthly memberships, and digital subscriptions, there’s a membership style that suits everyone. But why do members return to a gym again and again? Even with pay-as-you-go style brands like Barry’s Bootcamp and SoulCycle, it’s common for users to visit the same fitness center. Let’s delve deeper into why members choose and stick with a specific gym.Whether you sign up for the gym to lose a little weight, gain muscle, or just move more, you’re looking for external motivation. It’s hard to stay motivated and hold yourself accountable. As a fitness authority, it’s your responsibility to motivate members and hold them accountable. Members who lack motivation stop attending classes and, eventually, leave. Fitness challenges, creating a community, and high-quality fitness instructors can increase motivation and boost retention. ",
      "category": "Fitness",
      "imageUrl": "https://res.cloudinary.com/amradham/image/upload/v1657461743/blog/vy7ptqllxgkvzxxmcfci.jpg",
      "author": "Amr",
      "date": "07/07/2022",
      "id": 5
    },
    {
      "title": "Tasty food ",
      "description": " tasty food ,substance consisting essentially of protein, carbohydrate, fat, and other nutrients used in the body of an organism to sustain growth and vital processes and to furnish energy. The absorption and utilization of food by the body is fundamental to nutrition and is facilitated by digestion. Plants, which convert solar energy to food by photosynthesis, are the primary food source. Animals that feed on plants often serve as sources of food for other animals. To learn more about the sequence of transfers of matter and energy in the form of food from organism to organism, see food chain.\n\nHunting and gathering, horticulture, pastoralism, and the development of agriculture are the primary means by which humans have adapted to their environments to feed themselves. Food has long served as a carrier of culture in human societies and has been a driving force for globalization. This was especially the case during the early phases of European trade and colonial expansion, when foods such as the hot red pepper, corn (maize), and sweet potatoes spread throughout Europe to Africa and Asia.",
      "category": "Food",
      "imageUrl": "https://res.cloudinary.com/amradham/image/upload/v1657433892/blog/qkv6scceqjd6umsugdvl.jpg",
      "author": "Hamza",
      "date": "07/07/2022",
      "id": 6
    },
    {
      "title": "Running Blog",
      "description": "Running is the way in which people or animals travel quickly on their feet. It is a method of travelling on land. It is different to walking in that both feet are regularly off the ground at the same time.[1] Different terms are used to refer to running according to the speed: jogging is slow, and sprinting is running fast. Running is a popular form of exercise. It is also one of the oldest forms of sport. The exercise is known to be good for health; it helps breathing and heartbeat, and burns any spare calories. Running keeps a person fit and active. It also relieves stress. Running makes a person thirsty, so it is important to drink water when running. Before going on a long run, do not forget to have a five-minute warm-up and some stretching exercises.\nAfter going on a long run, do not forget to have ten-minutes of cool-down with some stretching exercises.\nIn the short term, try running on a flat surface. In the long term coaches recommend cross-country running. Running in a way to reduce loading on legs. One method is to use a treadmill, the better is to run in minimal shoes. These allow the runner's feet to feel the ground and so not inadvertently overload the foot/ankle. Over-cushioned shoes prevent the foot from feeling what it is doing and can also damage ones shins and knees. This topic has been very controversial. There are countless coaches, runners, and scientists who argue that minimal shoes are a main culprit in injuries in runners. They highly recommend shoes that offer stability and cushioning. Many runners with injuries have found that switching to cushioned shoes has improved/cured them of their injuries.",
      "category": "Fitness",
      "imageUrl": "https://res.cloudinary.com/amradham/image/upload/v1657431288/blog/swlqzxn9htucpms4fyuo.jpg",
      "author": "Adham",
      "date": "07/10/2022",
      "id": 7
    },
    {
      "title": "Food Bolg",
      "description": "Blogging is a common marketing and brand development tool for restaurants, catering companies, meal delivery services, private chefs, and other food and beverage businesses. Businesses often choose influential bloggers in the market, or \"influencers\". Influencers, are able to draw a specific audience and build their reputation by consistently posting quality content. Over time, the blogger accumulates influence over some of their audience. Consumers often build a connection with the influencer they closely follow affecting their purchasing decisions. Audiences often trust the endorsement of influencers because while they can be sponsored they are loyal to their followers and have freedom to design their messages. This is what the blogger can \"sell\" to companies whose products and services they'd endorse or be sponsored by",
      "category": "Food",
      "imageUrl": "https://res.cloudinary.com/amradham/image/upload/v1657435895/blog/jfi5oddvyddbrhyg4v1v.jpg",
      "date": "07/05/2022",
      "id": 8,
      "author": "Ahmed"
    }
  ]
}